Reports/ИсторияСтатусовСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Report>
		<Properties>
			<Name>ИсторияСтатусовСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/СтатусСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>СтатусСпецификации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСпецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Спецификация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ИсторияСтатусовСпецификаций/Ext/ManagerModule.bsl
Функция СформироватьОтчет(Спецификация) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ИсторияСтатусовСпецификаций.ПолучитьМакет("МакетИсторияСтатусов");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусСпецификации.Период,
	|	СтатусСпецификации.Автор,
	|	СтатусСпецификации.Статус
	|ИЗ
	|	РегистрСведений.СтатусСпецификации КАК СтатусСпецификации
	|ГДЕ
	|	СтатусСпецификации.Спецификация = &Спецификация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка.Параметры.Спецификация = Спецификация;
	
	ТабДок.Вывести(ОбластьШапка);
	
	Номер = 1;
	
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		ОбластьСтрока.Параметры.Номер = Номер;
		ТабДок.Вывести(ОбластьСтрока);
		Номер = Номер + 1;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
